Revit 2024 API
FaceDetailNode.LineProperties Property
 Access to the line (pen) properties of the curve being drawn.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2020
Syntax
C#
public LineProperties LineProperties { get; }
Visual Basic
Public ReadOnly Property LineProperties As LineProperties
	Get
Visual C++
public:
property LineProperties^ LineProperties {
	LineProperties^ get ();
}
See Also
FaceDetailNode Class
Autodesk.Revit.DB Namespace